import React from 'react';
import './RulesPage.scss';

const RulesPage = () => {
    return (
        <div className="rules-page">
            <h2>Дата последнего редактирования: 17 ноября 2023</h2>
            <h1>ОСНОВНЫЕ ТЕРМИНЫ</h1>
            <div className="rules-content">
                <div className="rule">
                    <strong>Правило</strong> – требование для исполнения неких условий (норма поведения) всеми
                    Пользователями какого-либо действия (игры, правописания, организации, учреждения), за невыполнение
                    которого предусмотрено наказание.
                </div>
                <div className="rule">
                    <strong>Наказание</strong> – определенное ограничение прав Пользователя в рамках проекта, следующее
                    за нарушение таковых правил проекта. Основные виды: Блокировка, Исключение, Отключение чата.
                </div>
                <div className="rule">
                    <strong>Блокировка</strong> – временный или постоянный запрет на осуществление какой-либо
                    деятельности.
                </div>
                <div className="rule">
                    <strong>Брутить</strong> – взламывать, подбирать или генерировать пароли иных Пользователей.
                </div>
                <div className="rule">
                    <strong>Оскорбление</strong> – умышленное унижение чести и достоинства личности. Оскорбление может
                    быть нанесено в виде высказывания или в виде действия.
                </div>
                <div className="rule">
                    <strong>Буллинг</strong> – психологический террор, травля одного человека другим. Буллинг
                    предполагает систематичность.
                </div>
                <div className="rule">
                    <strong>Разжигание розни</strong> – действия, способные задеть чувства определенной группы лиц,
                    основанные на определенных характеристиках этой группы, разжиганием розни так же считаются любые
                    уничижительные высказывания с упоминанием этой группы.
                </div>
                <div className="rule">
                    <strong>Мультиаккаунт</strong> – дополнительный аккаунт пользователя, зарегистрированный с одного
                    устройства или айпи адреса.
                </div>
                <div className="rule">
                    <strong>MINECRAFT</strong> – компьютерная инди-игра в жанре песочницы, выпущенная студией Mojang AB.
                </div>
                <div className="rule">
                    <strong>SURVIVAL</strong> – определенный режим игры MINECRAFT, что заключается в игровом выживании
                    на сервере.
                </div>
                <div className="rule">
                    <strong>Staff</strong> – это определенный состав Пользователей, одобренный и исполняющий правила на
                    сервере. Являются подгруппами Администрации проекта. Обозначаются префиксами:
                </div>
                <div className="rule">
                    <strong>Администрация</strong> – это основатели и доверенные лица проекта. Преследуют те же функции
                    и обязанности, что и модерация. Имеют неограниченные полномочия в рамках проекта. Обозначаются
                    префиксами:
                </div>
            </div>

            <h1>1. ОСНОВНЫЕ ПРАВИЛА</h1>
            <div className="rules-content">
                <div className="rule">
                    <strong>1.1</strong> Регистрируясь на проекте, Пользователь соглашается со всеми правилами, а также
                    с политикой
                    обработки персональных данных.
                </div>
                <div className="rule">
                    <strong>1.2</strong> Правила проекта состоят из правил сервера и правил vanilla и подлежат их
                    исполнению, в зависимости от выбранной категории участия в проекте.
                </div>
                <div className="rule">
                    <strong>1.3</strong> Нарушение правил, а также его наказумость и иные административные последствия
                    определяются только:
                    Правилами режима VANILA( когда Пользователь зарегистрировался на проекте сервера игры MINECRAFT),
                    Правилами форума и социальных сетей(при испольщовании Пользователем одной из официальных источников
                    проекта),
                    Общими правилами (если Пользователь зарегистрировался либо принял участие в одном или всех
                    вышеописанных игровых режимов, источников).
                </div>
                <div className="rule">
                    <strong>1.4</strong> Применение наказания по аналогии не допускается.
                </div>
                <div className="rule">
                    <strong>1.5</strong> Пользователи, нарушившие правила проекта, равноправны и подлежат
                    административной ответственности проекта независимо от пола, расы, национальности, языка,
                    происхождения, имущественного и должностного положения, места жительства, отношения к религии,
                    убеждений, принадлежности к общественным объединениям, а также других обстоятельств.
                </div>
                <div className="rule">
                    <strong>1.6</strong> Пользователь подлежит наказанию только за те нарушения правил, в отношении
                    которых установлена его вина.
                </div>
                <div className="rule">
                    <strong>1.7</strong> Объективное вменение, то есть административная ответственность на проекте за
                    невиновные действия, не допускается.
                </div>
                <div className="rule">
                    <strong>1.8</strong> Незнание правил не освобождает Пользователя от административной ответственности
                    проекта. Будь то ошибкой,
                    непреднамеренным действием или иным, характерным по свойствам деянием.
                </div>
                <div className="rule">
                    <strong>1.9</strong> Пользователь несет полную ответственность за безопасность своего аккаунта и
                    обязуется соблюдать все надлежащие меры
                    по обеспечению его безопасности.
                </div>
                <div className="rule">
                    <strong>1.10</strong> При возникновении спорных ситуаций или ситуаций, отсутствующих в правилах,
                    администратор имеет право разрешить
                    ситуацию согласно своим умозаключениям.
                    на сервере.
                </div>
                <div className="rule">
                    <strong>1.11</strong> Ресурсы проекта бесплатны и работают по принципу «как есть» без каких-либо
                    гарантий правильной работы. Ни при каких
                    условиях Администрация не обязана возвращать вещи утраченные из-за непредвиденных обстоятельств
                    (багов, откатов,
                    вайпов, краж, очисток и т.д.).
                </div>
                <div className="rule">
                    <strong>1.12</strong> Администрация оставляет за собой право не раскрывать подробности работы
                    системы автоматического наказания
                    игроков (далее – античит, либо – система) в целях обеспечения безопасности этой системы и
                    предотвращения их обхода от
                    недобросовестных Пользователей.
                </div>
                <div className="rule">
                    <strong>1.13</strong> В случае неоднократного нарушения правил, а в особенности одного и того же
                    пункта правил, пользователь может
                    получить более строгое наказание вплоть до перманентного бана.
                </div>
                <div className="rule">
                    <strong>1.14</strong> Администрация может использовать сторонные ресурсы, социальные сети (Discord,
                    Вконтакте, YouTube и т.д.) с целью
                    выдачи наказаний и сбора информации.
                </div>
                <div className="rule">
                    <strong>1.15</strong> Каждый пользователь обязан руководствоваться нормами поведения в обществе,
                    принципами справедливости и честной
                    игры.
                </div>
            </div>


            <h1>2. ПРАВИЛА РЕЖИМА VANILLA</h1>
            <div className="rules-content">
                <div className="rule">
                    <strong>2.1</strong> Соблюдайте адеватное поведение. Помните, что это многопользовательская среда, а
                    не ваш собственный сервер. Всегда учитывайте, какие последствия могут возникнуть из-за ваших
                    действий для других игроков.
                    <h3>Наказание:</h3> Блокировка игрового аккаунта сроком до 1 года.
                </div>
                <div className="rule">
                    <strong>2.1</strong> Запрещается совершение любых действий, направленных на обман, использование
                    читов или уязвимостей сервера.
                    <h3>Наказание:</h3> Блокировка игрового аккаунта сроком до 1 года на усмотрение Администрации.
                </div>
                <div className="rule">
                    <strong>2.1</strong> Запрещено гриферство, вмешательство в имущество других игроков и воровство. Все
                    изменения в блоках записываются и регистрируются. Мы сможем установить вашу ответственность за эти
                    действия и быстро откатить ущерб, а также наказать вас перманентным баном.
                    <h3>Наказание:</h3> Блокировка игрового аккаунта сроком до 1 года на усмотрение Администрации.
                </div>
                <div className="rule">
                    <strong>2.1</strong> Запрещена целенаправленная реклама стороннего проекта, организации, канала или
                    блога не относящийся к проекту PfauMC в любом его виде, в том числе скрытая реклама, без разрешения
                    Администрации проекта.
                    <h3>Наказание:</h3> Блокировка игрового аккаунта до 30д.
                </div>
                <div className="rule">
                    <strong>2.2</strong> Пользователю запрещается продавать или обменивать игровые ресурсы, на реальные
                    деньги, в том числе скрыто или
                    завуалированно просить перейти в другой чат или приложение, для совершения такового действия.
                    <h3>Наказание:</h3> Блокировка игрового аккаунта до 30д.
                </div>
                <div className="rule">
                    <strong>2.3</strong> Пользователю запрещается продавать, передавать или обменивать Аккаунт.
                    <h3>Наказание:</h3> Блокировка по IP навсегда.
                </div>
                <div className="rule">
                    <strong>2.4</strong> Пользователю запрещено использовать Мультиаккаунты с целью обхода временного
                    наказания, выданного на основной Аккаунт Пользователя.
                    <h3>Наказание:</h3> Блокировка по IP до 30 дней.
                </div>
                <div className="rule">
                    <strong>1.5</strong> Пользователю запрещается выдавать себя за Staff и администрацию проекта при
                    любых обстоятельствах,
                    регистрировать никнеймы, ставить аватары или скины, прямо или косвенно содержащие в себе
                    ненормативную лексику,
                    нецензурные выражения, носящие эротический или аморальный характер, свастику и политический контент,
                    также,
                    нарушающие другие пункты , либо же содержащие явную отсылку к Staff или администрации проекта.
                    <h3>Наказание:</h3> Блокировка навсегда.
                </div>
                <div className="rule">
                    <strong>2.6</strong> Пользователю запрещено уклоняться от проверок, провоцировать на активные
                    действия без уважительных причин и не
                    выполнять другие правомерные требования Staff или администрации проекта. Также запрещено
                    целенаправленно
                    отвлекать или препятствовать Staff’y и администрации.
                    <h3>Наказание:</h3> Блокировка до 48 часов.
                </div>
                <div className="rule">
                    <strong>2.7</strong> Запрещается разжигать межнациональную, религиозную, гендерную рознь, обсуждать
                    политику, публиковать аморальный
                    и 18+ контент, а также дискриминировать, оскорблять, унижать, буллить и кибербуллить (в том числе
                    родственников),
                    подстрекать на нарушения, а так же спамить, флудить, многократно повторять сообщения, команды или
                    растягивать текст.
                    <h3>Наказание:</h3> Предупреждение.
                    <h4>Рецидив:</h4> Блокировка до 4 часов.
                </div>
                <div className="rule">
                    <strong>2.8</strong> Пользователю запрещены безосновательные негативные высказывания, осуждения и
                    нецелесообразные оценки сервера,
                    действий Администрации или Staffa и их соответственно, вне специально отведенных для этого мест, а
                    так же носящие под собой вред деловой репутации проекта.
                    <h3>Наказание:</h3>Блокировка до 2 дней.
                    <h4>Рецидив:</h4> Блокировка до 7 дней.
                </div>
                <div className="rule">
                    <strong>2.9</strong> Пользователю запрещается обманывать других пользователей в процессе обмена
                    внутриигровых ценностей.
                    <h3>Наказание:</h3>Блокировка до 7 дней
                </div>
            </div>


            <h1>МОДИФИКАЦИИ</h1>
            <div className="rules-content">
                <div className="rule">
                    <strong><p className="p_1">Разрешенные моды:</p></strong>
                    <p>- Улучшения производительности (Lithium, Sodium, Phosphor и т. д.)</p>
                    <p>- Можно использовать моды, направленные на повышение производительности клиента без изменения
                        игрового процесса.</p>
                    <p>- Миникарты (VoxelMap, Xaero's Minimap и т. д.)</p>
                    <p>- Моды записи повторов (ReplayMod)</p>

                    <strong><p className="p_1">Прочие улучшения игры:</p></strong>
                    <p>- Модификации в целом приемлемы, если они не дают значительного игрового преимущества в ситуациях
                        PvE или PvP, а также в выживании.</p>
                    <strong><p className="p_1">Допустимые примеры:</p></strong>
                    <p>- Сортировка инвентаря</p>
                    <p>- Состояние брони HUD</p>
                    <p>- Отображение информации о целевом блоке</p>
                    <p>- Индикаторы уровня освещенности</p>
                    <p>Все, что показывает информацию, которую игра уже сообщила вам в другом месте, например,
                        на экране
                        отладки (F3).</p>
                    <strong><p className="p_1">Недопустимые примеры:</p></strong>
                    <p>- Любые читы</p>
                    <p>- Автокликеры и другие автоматические действия.</p>
                    <p>- Автоматическая замена, экипировка или создание предметов без участия игрока</p>
                    <p>- Скрипты или макросы</p>
                    <p>- Модификации-схемы, которые отображают «голограммы» для помощи в строительстве,
                        разрешены при
                        условии, что они не автоматизируют какую-либо часть самого процесса
                        строительства.</p>
                </div>

            </div>


            <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css"/>
            <div className="social-icons">
                {/*<a href="https://discord.com/invite/cQMVwEth" target="_blank"><i className="fab fa-discord"></i></a>*/}
                {/*<a href="https://t.me/pfaumc" target="_blank"><i className="fab fa-telegram-plane"></i></a>*/}
                {/*<a href="https://www.tiktok.com/@pfaumc.io?_t=8maTAytrFMu&_r=1" target="_blank"><i*/}
                {/*    className="fab fa-tiktok"></i></a>*/}
                {/*<a href="https://youtube.com/@pfaumc?si=wNfsT74Iu_mwaDbQ" target="_blank"><i*/}
                {/*    className="fab fa-youtube"></i></a>*/}
                {/*<a href="https://vk.com/pfaumc" target="_blank"><i className="fab fa-vk"></i></a>*/}
            </div>
        </div>


    );
};

export default RulesPage;
